Revit 2027 API
PrimarySizeCriterion.All Method
 Creates a criterion with a range of all sizes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PrimarySizeCriterion All()
Public Shared Function All As PrimarySizeCriterion
public:
static PrimarySizeCriterion^ All()
static member All : unit -> PrimarySizeCriterion
Return Value
PrimarySizeCriterion
 The new criterion.
See Also
Reference
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace